snlkuharlocal/src/Catalogs/ИнтервалыКлассификации/ИнтервалыКлассификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтервалыКлассификации</name>
  <tabularSections>
    <name>Интервалы</name>
    <attributes>
      <name>НижняяГраницаИнтервала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраницаИнтервала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИнтервала</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ИнтервалыКлассификации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КоличествоЭтапов = Интервалы.Количество();
	
	Если КоличествоЭтапов < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Для ВнешнийСчетчик = 2 По КоличествоЭтапов Цикл
	
		ИндексПредыдущегоЭтапа  = ВнешнийСчетчик - 2;
		ИндексТекущегоЭтапа     = ВнешнийСчетчик - 1;
		ПредыдущееЗначениеСрока = Интервалы[ИндексПредыдущегоЭтапа].НижняяГраницаИнтервала;
		ТекущееЗначениеСрока    = Интервалы[ИндексТекущегоЭтапа].НижняяГраницаИнтервала;
		
		// Значение поля НижняяГраницаИнтервала табличной части Интервалы
		// должно идти по возрастанию. Это необходимо для того, чтобы
		// дебиторская задолженность могла быть отнесена только к одному этапу.
		Если ТекущееЗначениеСрока <= ПредыдущееЗначениеСрока Тогда
			
			ТекстОшибки = СтрШаблон("Нижняя граница в строке %1 должна быть больше, чем в строке %2.", ИндексТекущегоЭтапа + 1, ИндексПредыдущегоЭтапа + 1);
			Сообщить(ТекстОшибки, СтатусСообщения.Важное);			
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	КоличествоИнтервалов       = Интервалы.Количество();
	НаименованиеИнтервалаСвыше = "Более %1";
	НаименованиеИнтервалаОтДо  = "От %1 до %2";
	ВерхняяГраницаИнтервала    = 999999999999999;
	
	Если Интервалы.Количество() = 1 Тогда
		
		Интервалы[0].ВерхняяГраницаИнтервала	= ВерхняяГраницаИнтервала;
		Интервалы[0].НаименованиеИнтервала		= СтрШаблон(НаименованиеИнтервалаСвыше, Интервалы[0].НижняяГраницаИнтервала);
		
	ИначеЕсли КоличествоИнтервалов > 1 Тогда
		
		Для ТекИндекс = 1 По КоличествоИнтервалов-1 Цикл			
			ПредыдущийЭтап = Интервалы[ТекИндекс-1];
			
			Если ТекИндекс < КоличествоИнтервалов Тогда				
				ПредыдущийЭтап.ВерхняяГраницаИнтервала = Интервалы[ТекИндекс].НижняяГраницаИнтервала-1;				
				ПредыдущийЭтап.НаименованиеИнтервала = СтрШаблон(НаименованиеИнтервалаОтДо, ПредыдущийЭтап.НижняяГраницаИнтервала, ПредыдущийЭтап.ВерхняяГраницаИнтервала);				
			КонецЕсли;
			
			Интервалы[КоличествоИнтервалов-1].ВерхняяГраницаИнтервала 	= ВерхняяГраницаИнтервала;
			Интервалы[КоличествоИнтервалов-1].НаименованиеИнтервала 	= СтрШаблон(НаименованиеИнтервалаСвыше, Интервалы[КоличествоИнтервалов-1].НижняяГраницаИнтервала);			
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
